package chess;

public class WhiteStandardSizeChess extends Chess {

    public WhiteStandardSizeChess() {
        setName("Белые шахматные фигуры стандартного размера");

        setKing("Фигура короля белого цвета");

        setQueen("Фигура ферзя белого цвета");

        setRook("Фигура ладьи белого цвета");

        setBishop("Фигура слона белого цвета");

        setKnight("Фигура коня белого цвета");

        setPawn("Фигура пешки белого цвета");
        /* name = "Белые шахматные фигуры стандартного размера";
         king = "Фигура короля белого цвета";
         queen = "Фигура ферзя белого цвета";
         rook = "Фигура ладьи белого цвета";
         bishop = "Фигура слона белого цвета";
         knight = "Фигура коня белого цвета";
         pawn = "Фигура пешки белого цвета";*/
    }

}
